
Feature: Управление на оценки

Background:
   Given Потребителят отваря екрана за управление на оценки

  
  Scenario: Успешно създаване на ученик
    When Въвежда потребителско име
    And Въвежда парола
    And Въвежда E-mail
    And Въвежда Родител
    And Въвежда Клас
    And Натисне бутона за създаване на ученик
    Then Вижда съобщение "Ученикът е успешно създаден"
    
  Scenario: Създаване на ученик без потребителско име
    When Въвежда парола
    And Въвежда E-mail
    And Въвежда Родител
    And Въвежда Клас
    And Натисне бутона за създаване на ученик
    Then Вижда съобщение "Невалидни данни"
    
    Scenario: Създаване на ученик без парола
    When Въвежда потребителско име
    And Въвежда E-mail
    And Въвежда Родител
    And Въвежда Клас
    And Натисне бутона за създаване на ученик
    Then Вижда съобщение "Невалидни данни"
    
    Scenario: Създаване на ученик без E-mail
    When Въвежда потребителско име
    And Въвежда парола
    And Въвежда Родител
    And Въвежда Клас
    And Натисне бутона за създаване на ученик
    Then Вижда съобщение "Невалидни данни"
    
    Scenario: Създаване на ученик без родител
    When Въвежда потребителско име
    And Въвежда парола
    And Въвежда E-mail
    And Въвежда Клас
    And Натисне бутона за създаване на ученик
    Then Вижда съобщение "Невалидни данни"
    
    Scenario: Създаване на ученик без Клас
    When Въвежда потребителско име
    And Въвежда парола
    And Въвежда E-mail
    And Въвежда Родител
    And Натисне бутона за създаване на ученик
    Then Вижда съобщение "Невалидни данни"
   
 Scenario: Неуспешно нанасяне на оценка
    Given Ученикът съществува
    When Въвежда оценка, която не е в диапазона от две до шест
    And Натисне бутона за нанасяне на оценка
    Then Вижда съобщение "Оценката не е валидна"
    
 Scenario: Успешно нанасяне на оценка
    Given Ученикът съществува
    When Въвежда оценка, която е в диапазона от две до шест
    And Натисне бутона за нанасяне на оценка
    Then Вижда съобщение "Оценката е успешно нанесена"
    
 
